{
  "stacks": [
    {
      "name": "MERN Stack",
      "database": "MongoDB",
      "backend": "Express.js",
      "frontend": {
        "primary": "React.js",
        "secondaries": ["Redux", "Sass"]
      },
      "pros": ["Javascript", "Scalable", "Community"],
      "cons": ["Learning curve", "Performance"],
      "description": "The MERN stack is a popular choice for building dynamic web applications. It utilizes JavaScript across the stack, making it simpler for someone with existing JavaScript knowledge to adopt. React.js offers a powerful and flexible frontend, ideal for a drag-and-drop interface. MongoDB's flexible schema makes it more adaptable for storing diverse design templates."
    },
    {
      "name": "LAMP Stack",
      "database": "MySQL",
      "backend": "PHP",
      "frontend": {
        "primary": "HTML/CSS/JavaScript",
        "secondaries": ["Bootstrap"]
      },
      "pros": ["Stable", "Mature", "Cost-effective"],
      "cons": ["Not as modern", "Less scalable", "Less dynamic"],
      "description": "The LAMP stack is a tried-and-true collection of technologies for web development. While it may not be the most cutting-edge, its stability and maturity can be beneficial. MySQL provides a robust database solution, and PHP is widely known and easy to deploy. This stack will be a safe choice for a beginner transitioning from design to full-stack development."
    },
    {
      "name": "Serverless w/ React",
      "database": "Firebase",
      "backend": "Serverless (AWS Lambda)",
      "frontend": {
        "primary": "React.js",
        "secondaries": ["Material-UI", "TypeScript"]
      },
      "pros": ["Scalable", "No infrastructure", "Fast development"],
      "cons": ["Vendor lock-in", "Cold start", "Complex debugging"],
      "description": "Serverless architecture offers scalability and faster development since infrastructure management is abstracted away. Firebase provides a fully managed, scalable NoSQL database that's easy to integrate with a web application. React.js as the frontend, complemented with Material-UI and TypeScript, will offer a modern, smooth, and type-safe development experience. This stack is beneficial for rapidly growing applications where scalability is crucial."
    }
  ]
}
